crypto-a/scadable-v5-test/sdkconfig.defaults
# Target: ESP32 classic
CONFIG_IDF_TARGET="esp32"

# 4 MB flash (chip has it; default config caps at 2 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Custom partition table with two OTA slots
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Allow plain HTTP for OTA downloads (MinIO over :9000, no TLS in V1).
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# Larger main task stack — JSON building and log buffer flushes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# MQTT outbox + buffer sizes large enough for ~12KB log batches
CONFIG_MQTT_BUFFER_SIZE=16384
CONFIG_MQTT_TASK_STACK_SIZE=8192

# Disable log color codes so the log sink sees plain text it can parse
CONFIG_LOG_COLORS=n

# Default log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# Reduce flash usage
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
